Repository: horizon-eda/horizon-docs
Catalog: locale/*/LC_MESSAGES/build-win32.po
Languages: cs

source: Building on Windows
cs: Sestavení (kompilace) programu na operačním systému Windows

source: Install MSYS2
cs: Nainstalujte program MSYS2

source: Download and run the msys2 installer from http://msys2.github.io/ I’ve only tested with the 64bit version, 32bit should work as well (but come on, it’s 2017…) Make sure that the path you select for installation doesn’t contain any spaces. (Don’t blame me for that one)
cs: Stáhněte si a spusťte instalátor programu msys2 z http://msys2.github.io/ Mám testováno pouze s 64bitovou verzí, 32bit by měla fungovat také. Ujistěte se, že cesta, kterou jste vybrali pro instalaci neobsahuje žádné mezery (v názvech složek).

source: Start MSYS console
cs: Spusťte konzolu MSYS

source: Launch the Start Menu item “MSYS2 mingw 64 bit” you should be greeted with a console window. All steps below refer to what you should type into that window.
cs: Spusťte položku nabídky Start „MSYS2 mingw 64 bit“, která by se měla zobrazit v okně konzoly. Všechny níže uvedené kroky se týkají toho, co by jste měli napsat do toho okna.

source: Install updates
cs: Nainstalujte aktualizace

source: Type
cs: Napište

source: if it tells you to close restart msys, close the console window and start it again. Then run ``pacman -Syu`` again.
cs: pokud vám řekne, že chce restartovat před restartováním, zavřete okno konzoly a po restartu znovu spusťte program ``pacman -Syu``.

source: Install dependencies
cs: Nainstalujte související součásti

source: Type/paste
cs: Napište / vložte

source: When prompted, just hit return. Sit back and wait for it to install what’s almost a complete linux environment.
cs: Až budete vyzváni, stačí stisknout klávesu Enter. Posaďte se a počkejte, až instalátor dokončí instalaci téměř kompletního linuxového vývojového prostředí.

source: Before continuing you may change to another directory. It easiest to type ``cd`` followed by a space and drop the folder you want to change to on the window.
cs: Než budete pokračovat, můžete přejít do jiné složky. Je to jednoduché zadejte `` cd``, mezerník a přetáhněte složku, do které chcete přejít do okna konzoly.

source: Clone horizon
cs: Klonovat zdrojový kód programu Horizon-EDA

source: Build it
cs: Sestavení (kompilace) programu ze zdrojového kódu

source: You may adjust the number to the number of CPUs in your system to speed up compilation. Expect 100% CPU load for several minutes. Due to debug symbols the resulting executables are of considerable size.
cs: Číslo 4 na konci můžete upravit podle počtu procesorů ve vašem systému pro rychlejší kompilaci. Očekávejte 100% zatížení procesoru (CPU) po dobu několika minut dle výkonu počítače. Z důvodu zapnuté volby vkládání ladících symbolů mají výsledné spustitelné soubory značnou velikost.

source: Running
cs: Spuštění programu

source: You won’t be able to double-click the resulting executables since all the required DLLs are in a directory unknown to windows. You’ll have to launch them from the mingw shell using ``./horizon-eda`` for example. For the pool download to work, you’ll have to copy the file ``/mingw64/ssl/certs/ca-bundle.crt`` to the directory the directory ``horizon-eda.exe`` resides in.
cs: Po kompilaci nebudete moci dvakrát kliknout na výsledné spustitelné soubory protože požadované knihovny DLL nejsou ve složce známé systému Windows. Budete muset spustit z příkazového řádku prostředí Mingw například pomocí příkazu ``./horizon-eda``. Aby fungovalo stahování fondu, musíte zkopírovat soubor ``/mingw64/ssl/certs/ca-bundle.crt`` do složky obsahující ``horizon-eda.exe``.

source: Packaging
cs: Vytvoření archivu

source: To create the zip archive as it’s available from the CI, run ``./make_bindist.sh``.
cs: Chcete-li vytvořit archiv ZIP, jak je dostupný ke stažení, spusťte příkaz ``./make_bindist.sh``.
