Repository: horizon-eda/horizon-docs
Catalog: locale/*/LC_MESSAGES/cli-usage.po
Languages: cs

source: CLI usage
cs: Použití příkazového řádku (CLI Command Line Interface)

source: The project and the pool manager have pretty much eliminated the need to run the interactive manipulator and other tools directly from a shell, but it’s still useful for development.
cs: Správce projektu a správce fondu do značné míry eliminovali potřebu spouštět interaktivní manipulátor a další nástroje přímo z příkazového řádku, ale je to stále užitečné pro vývoj.

source: All of the commands below require the environment variable ``HORIZON_POOL`` to point to the pool’s directory (the one with the pool.json and pool.db in it)
cs: Všechny níže uvedené příkazy vyžadují proměnnou prostředí ``HORIZON_POOL``, nastavenou na složku fondu (obsahující soubor pool.json a pool.db)

source: horizon-imp
cs: Použití horizon-imp

source: Symbol mode:
cs: Režim symbolů:

source: ``horizon-imp -y <symbol file>``
cs: ``horizont-imp -y <soubor symbolu>``

source: Schematic mode:
cs: Schematický režim:

source: ``horizon-imp -c <schematic file> <block file>``
cs: ``horizon-imp -c <soubor schematu> <soubor bloku>``

source: Padstack mode:
cs: Režim padstack:

source: ``horizon-imp -a <padstack file>``
cs: ``horizon-imp -a <soubor pájecího obrazce>``

source: Package mode:
cs: Režim balíčku:

source: ``horizon-imp -k <package file>``
cs: ``horizon-imp -k <soubor pouzdra součástky>``

source: Board mode:
cs: Režim desky:

source: ``horizon-imp -b <board file> <block file> <via directory>``
cs: ``horizon-imp -b <soubor desky> <soubor bloku> <přes složku>``

source: horizon-pool
cs: Použití horizont-pool

source: Most of the -edit and -create commands will spawn $EDITOR with the file to be edited serialized as YAML.
cs: Většina příkazů -edit a -create spustí příslušný $EDITOR, který vytvoří odpovídající soubor ve formátu YAML.

source: Remember to run ``horizon-pool update`` after creating things
cs: Po vytvoření souborů nezapomeňte spustit ``horizon-pool update``

source: horizon-prj
cs: Použití horizont-prj

source: Use these to create empty blocks, schematics, etc.
cs: Pomocí těchto příkazů můžete vytvářet prázdné bloky, schémata atd.
