Repository: horizon-eda/horizon-docs
Catalog: locale/*/LC_MESSAGES/imp-board.po
Languages: cs

source: Board Editor
cs: Editor desky plošných spojů DPS (PCB)

source: To launch the schematic editor click on “Board” in the project manager.
cs: Chcete-li spustit editor desky plošných spojů (dále jen desky), klikněte na „Board“ ve správci projektu. Stejně jako všechny ostatní grafické editory je i editor desky v Horizon-EDA založen na Interaktivním manipulátoru

source: The board editor keeps an internal copy of the netlist. To update the netlist, click "Save" in the schematic editor for writing the netlist to disk, then click on ’reload netlist’ or re-open the board editor or use the action "Save and reload netlist" in the the schematic editor.
cs: Editor desky si udržuje interní kopii seznamu spojů (netlist). Chcete-li aktualizovat seznam spojů, stiskněte „Save“ (Uložit) v editoru schémat pro zápis seznamu spojů na disk, pak klikněte v editoru desky na „reload netlist“ pro aktualizaci seznamu spojů nebo znovu otevřete editor desky.

source: Planes
cs: Vyplněné oblasti (Planes)

source: For adding planes, first draw a polygon of the desired shape in a copper layer. Then use the “Add plane” tool to assign it a plane. Planes with lower priority will get filled first.
cs: Pro přidání vyplněných oblastí nejprve nakreslete do hladiny spojů (copper) mnohoúhelník (polygon) požadovaného tvaru. Poté pomocí nástroje „Add plane“ přiřaďte oblast. Pro zobrazení vyplněných oblastí je nutné aktualizovat tyto oblasti pomocí příkazu „Update all Planes“. Oblasti s nižší prioritou se vyplní jako první.

source: Vias
cs: Prokovené otvory (Vias)

source: Before placing a via, create a default rule for vias in the “Rules” window and assign it the desired padstack.
cs: Před vložením prokoveného otvoru vytvořte výchozí pravidlo pro tyto otvory v okně pravidel „Rules“ a přiřaďte jim požadovaný tvar (padstack).

source: Diffpairs
cs: Diferenciální páry

source: To create a diffpair see :ref:`Schematic Diffpairs<Schematic Diffpairs>` . Before routing a diffpair, create a diffpair rule specifying track width and gap. To route a diffpair, use the “Route diff. pair” tool.
cs: Jedná se o speciální útvar trasy signálového páru se stanovenými parametry vzájemných elektrických vlastností. Chcete-li vytvořit diferenciální pár, podívejte se na :ref:`Diferenciální páry<Schematic Diffpairs>`. Před trasováním diferneciálního páru, vytvořte pravidlo určující šířku stopy a mezeru tohoto páru. Chcete-li vést trasu, použijte nástroj „Route diff“.

source: Screenshot
cs: Snímek obrazovky
