Repository: horizon-eda/horizon-docs
Catalog: locale/*/LC_MESSAGES/parameter-programs.po
Languages: cs

source: Parameter Programs
cs: Parametry programu

source: As explained on other pages, horizon supports parametrizable padstacks and (to a limited extent) packages. To apply the given parameters to the existing geometry, each padstack and the like is accompanied by a small program.
cs: Jak již bylo popsáno jinde v dokumentu, Horizon-EDA podporuje parametrizovatelné tvary pájecích míst a (v omezené míře) pouzder součástek. Chcete-li použít dané parametry na existující geometrii, každé pájecí místo a podobné objekty je možné změnit pomocí krátkého makra.

source: These programs are written in a custom stack-based language. Users of HP calculators should feel familiar. Since there aren’t any loops, these programs will terminate in finite time. The stack holds signed 64bit integers. Conceptually, it grows from top to bottom.
cs: Tyto makra jsou psány ve vlastním zásobníkovém jazyce. Uživatelé kalkulaček HP se měli cítit jako doma. Protože v programu není možné provádět žádné smyčky, budou tyto programy ukončeny v daném čase. Zásobník obsahuje 64bitová celá čísla se znaménkem. Koncepčně roste shora dolů.

source: Syntax
cs: Syntaxe

source: On the top level, a program is made up of tokens. Tokens are separated by any amount of whitespace.
cs: Na nejvyšší úrovni je program tvořen značkami. Značky jsou oddělené libovolným množstvím mezer.

source: Token types:
cs: Typy značek:

source: Integers: a number, optionally prefixed by a sign
cs: Celá čísla: číslo, volitelně opatřené znaménkem

source: Dimension: a number with optional fractional part, suffixed by “mm”. The float before mm will get multiplied by 1e6, since horzion’s internal unit of measurement is 1nm
cs: Rozměr: číslo s volitelnou zlomkovou částí, s příponou „mm“ plovoucí řádová značka před značkou mm se vynásobí 1x10^6, od vnitřní jednotka měření programu Horizon-EDA je 1nm

source: Mathematical operators such as: ``+ - * /``
cs: Matematické operátory, jako například: ``+ - * /``

source: Strings
cs: Řetězce znaků

source: Argument start ``[`` and end ``]`` any token between these two will get appended to the last command’s arguments
cs: Parametry začínají znakem ``[`` a končí ``]`` jakákoliv značka mezi těmito dvěma znaky bude přidána jako parametr předchozího příkazu

source: Generic Commands
cs: Obecné příkazy

source: Zero-operand
cs: Nulový operand

source: ``get-parameter [ <parameter> ]`` gets paramter and pushes it onto the stack
cs: ``get-parameter [<parameter>]`` načte paramter a vloží jej na zásobník

source: One-operand
cs: Jeden operand

source: Two-operand
cs: Dva operandy

source: Three-operand
cs: Tři operandy

source: Padstack commands
cs: Příkazy pro pájecí místa

source: In order for an object (shape, etc.) to be manipulated by the program, it needs to be assigned a parameter class. ## set-shape ``set-shape [ <parameter class> <form> ]`` Sets a shape to the specified form or moves it to the specified position Valid forms:
cs: Aby program mohl manipulovat s objektem (tvaru atd.), musí být přiřazena třída parametrů. ## set-shape ``set-shape [<třída parametrů> <form>]`` Nastaví tvar na zadaný formulář nebo jej přesune na určenou pozici Platného formuláře:

source: ``rectangle``, pops height, width
cs: ``obdélník``, zobrazí výšku, šířku

source: ``circle``, pops diamater
cs: ``kruh``, zobrazí průměr

source: ``obround``, pops height, width
cs: ``obround``, zobrazí výšku, šířku

source: ``position``, pops y, x
cs: ``pozice``, zobrazí polohu y, x

source: set-hole
cs: Zadání otvoru

source: ``set-hole [ <parameter class> <shape> ]`` Sets a hole to the specified shape Valid shapes:
cs: ``set-hole [<třída parametrů> <shape>]`` Nastaví díru na specifikovaný tvar z přednastavených možností:

source: ``round``, pops diameter
cs: ``kulatý``, zobrazí průměr

source: ``slot``, pops length, diameter
cs: ``slot``, zobrazí délku, průměr

source: Polygon commands (padstack and package)
cs: Polygonové příkazy (pájecí místa a pouzdra součástek)

source: set-polygon
cs: Zadání polygonu

source: ``set-polygon [ <parameter class> <shape> <x0> <y0> ]`` Sets a polygon to the specified shape with center at (x0,y0) Valid shapes:
cs: ``set-polygon [<třída parametrů> <shape> <x0> <y0>]`` Nastaví polygon před připraveného tvaru se středem na (x0, y0) z vybraných možností:

source: ``circle``, pops diameter
cs: ``kruh``, zobrazí průměr

source: set-polygon-vertices
cs: Zadání vrcholů polygonu

source: ``set-polygon-vertices [ <parameter class> <n_vertices> ]`` Pops ``n_vertices`` coordinates from the stack and replaces the polygon's vertices with them.
cs: `` set-polygon-vertices [<třída parametrů> <n_vertices>] `` Načte ``n_vertices`` souřadnic vrcholů ze zásobníku a vytvoří z nich mnohoúhelník.

source: expand-polygon
cs: Vytvoření polygonu

source: ``expand-polygon [ <parameter class> <x0> <y0> <x1> <y1> ... <xn> <yn> ]`` Pops expansion. Expands the polyon specified by the coordinates in the argument by the dimension popped from the stack.
cs: ``expand-polygon [<třída parametrů> <x0> <y0> <x1> <y1> ... <xn> <yn>]`` Vytvoří polygon určený hodnotami souřadnic v parametrech načtených ze zásobníku.

source: Example program (from SMD rectangular padstack)
cs: Příklad programu (pro SMD obdélníkové pájecí místo)
