Repository: horizon-eda/horizon-docs
Catalog: locale/*/LC_MESSAGES/pool-mgr.po
Languages: cs

source: Pool Manager
cs: Správce fondu (Pool manager)

source: The Pool Manager and Part Wizard help with managing things in the Pool like symbols, entities and parts. You're most likely to use the Pool Manager for creating new parts. To open the pool manager, launch Horizon EDA and click on the recently opened pool you like to edit. If you never opened a pool before, you can manually select a pool.json you like to open or create a new one. Depending on what kind of part you want to create, several workflows are available:
cs: Správce fondu a Průvodce součástí pomáhají se správou komponent jako jsou symboly, entity a součástky ve fondu. Pravděpodobně budete používat Správce fondu pro vytváření nových dílů. Chcete-li otevřít správce fondu, spusťte ``horizon-eda`` \ (`` .exe``) a vyhledejte soubor pool.json fondu, který chcete upravit. Podle toho, jakou komponentu chcete vytvořit, je k dispozici několik pracovních postupů:

source: Inherting from an existing part
cs: Zdědění nové součásti z existující součásti

source: When the part you're about to create already exisits in a different variant (different value or different temperature range) but is otherwise all identical, the new part should inherit from the existing part. To do so, select the desired base part in the "Parts" tab and click "Create Part from Part". After having specified the new part's location, you'll be shown the Part Editor. Uncheck the "inherit" option for the attributes you'd like to change and save the new part.
cs: Když součástka, kterou se chystáte vytvořit, již existuje v jiné variantě (jiná hodnota, nebo jiný teplotní rozsah), ale jinak shodná, tak by nová součástka měla být zděděna ze stávající součástky. Chcete-li to provést, vyberte požadovanou základní součástku na záložce "Parts" a klikněte na "Create Part from Part". Po zadání umístění souboru nové součástky se zobrazí Editor součástek. Zrušte zaškrtnutí možnosti „zdědit“ (inherit) pro atributy, které chcete změnit a uložte novou součástku.

source: Create part from existing Entity
cs: Vytvoření nové součásti ze stávající entity

source: This workflow is appropriate when the Entity for the new part already exists. Resistors or LEDs in nonstandard packages are of this kind, for example. A Part is made up from a Entity and a Package, if the Package for the Part you want to make doesn't exist you will have to create it (see see :doc:`create-package`).
cs: Tento pracovní postup je vhodný, pokud již entita pro novou součást existuje. Odpory nebo LED v nestandardních pouzdrech jsou typickým příkladem. Pro vytvoření nového pouzdra viz :doc:`create-package`. Na záložce "Parts" klikněte na "Create Part" pro vytvoření nové součásti. Potom zadejte entitu, pouzdro a umístění souboru součástky, kterou můžete pozměnit a mapovat pájecí místa na vývody v Editoru součástí.

source: Create all-new part
cs: Vytvoření zcela nové součásti

source: Many parts such as MCUs, FPGAs, ADCs and other miracles of today's world require creating new units and entities. Doing so manually would be very tedious, that's why there's the Part Wizard to assist you. After having selected the part's package (for creating packages, see :doc:`create-package` ) in the "Packages" tab, click on "Part Wizard..." to launch it. You'll be greeted with a list of all Pads of the package.
cs: Mnoho součástek, jako jsou mikroprocesory (MCU), FPGA, ADC a další zázraky dnešního světa vyžadují vytvoření nových jednotek a entit. To by bylo manuálně velmi zdlouhavé, v tomto vám může pomoci průvodce součástí (Part Wizard). Poté, co vyberete pouzdro součástky (pro vytváření pouzder součástek viz :doc:`create-package`) na záložce "Packages" klikněte na "Part Wizard...". Budete uvítáni seznamem všech pájecích míst pouzdra.

source: Fill in the pin names according to the datasheet. Only put the pins primary name (like PB5) on an MCU in the leftmost entry and put all other names (like UART0_TX, TA0) space-separated in the "Alt. names" Entry. If your part is *really* big (such as an FPGA or large MCU) you may want it to appear as more than one symbol in the schematic. To do so, select all the pads you'd like to have in the same symbol and type in the new Gate name. In case many Pads are electrically identical (such as many GND pads) you may group them by selecting them and clicking the "Link Pads" button in the bottom toolbar. This way, only one Pin will be generated for these Pads.
cs: Vyplňte názvy vývodů podle katalogového listu součástky. Vložte pouze primární jméno vývodu (např. PB5) na MCU do sloupce zcela vlevo a vložte všechny ostatní názvy (jako UART0_TX, TA0) oddělené mezerou do sloupce "Alt. names". Pokud je vaše součástka *opravdu* velká (jako FPGA nebo velký MCU), může potřebovat, aby se ve schématu zobrazil více než jeden symbol. Vyberte všechny vývody, které chcete mít se stejným symbolem a typem v alternativním názvu vývodu. V případě, že je více podložek elektricky identických (např několik vývodů GND), můžete je seskupit jejich výběrem a kliknutím na Tlačítko „Propojit podložky“ na dolním panelu nástrojů. Tímto způsobem bude pro vybrané položky vytvořen pouze jeden vývod.

source: Reasonable sources for pin/pad name data are:
cs: Vhodnými zdroji údajů se jmény vývodů a pájecích míst jsou:

source: IBIS models
cs: IBIS modely

source: BSDL files
cs: BSDL soubory

source: PDF datasheets
cs: katalogové listy PDF dané součástky

source: Once you're done filling in the pin names, click "Next" in the top left corner for advancing to the next screen. Fill in the entries according to your part. In case you're unsure on what to put in, take a look at existing parts in the pool. If your part is available in multiple almost-identical variants that only differ in aspects such as temperature range or packing option (Tape/Reel, Tube, etc.) create the part you're about to use. For creating the other variants, follow the instructions in the topmost section. Take care of specifying the correct location for units/symbols/entity and parts, so that they end in a subdirectory of their respective directory in the pool.
cs: Jakmile vyplníte názvy vývodů, klikněte vlevo nahoře na „Další“ pro postup na další obrazovku. Vyplňte položky podle vaší součástky. Pokud si nejste jisti, co tam má být, podívejte se na stávající součástky ve fondu. Pokud je vaše součástka k dispozici vícekrát v téměř identických variantách, které se liší pouze v aspektech jako teplotní rozsah nebo možnost balení (Páska / Role, Trubka, atd.) vytvoří součástku, kterou se chystáte použít. Pro vytvoření dalších variant postupujte podle pokynů v horní části. Postarejte se o správné zadání umístění jednotek / symbolů / entit a částí tak, aby končily v podsložkách jejich příslušné složky ve fondu.

source: For each gate, click on "Edit Symbol" for launching an interactive manipulator to create the symbol for that unit. Use the "Map pin" tool to place the pins in the symbol and "Draw line rectangle"/"Edit line rectangle" for drawing the symbols body. Don't forget to give the symbol a meaningful name and place the "$REFDES" and "$VALUE" texts.
cs: Pro každý celek (gate) klikněte na "Edit Symbol" pro spuštění interaktivního manipulátoru vytvoříte symbol pro tuto jednotku (unit). Použijte příkaz „Map pin“ pro umístění vývodů do symbolu a "Draw line rectangle"/"Edit line rectangle" pro nakreslení těla symbolu. Nezapomeňte dát symbolu smysluplné jméno a umístěte texty "$REFDES" a "$VALUE".

source: When you've drawn all the symbols an filled in all of the metadata, click "Finish" to finally insert the part into the pool.
cs: Když nakreslíte všechny symboly a vyplníte všechny údaje, kliknutím na "Finish" konečně vložíte součást do fondu.

source: Where to save things
cs: Kam ukládat komponenty

source: When creating new symbols, parts and the like the pool manager/part wizard will sooner or later ask you for a file name or a directory (in case of packages) to save the new part. Technically, the path you specify only needs to meet two requirements:
cs: Při vytváření nových symbolů, součástek a podobně správce fondu / průvodce tvorbou součástek vás dříve nebo později požádá o název souboru nebo složky (v v případě pouzder) k uložení nové součástky. Technicky, vámi specifikovaná cesta pouze musí splňovat dva požadavky:

source: It needs to be in the correct top-level directory, i.e. every symbol has to be somewhere in /symbols and so on. Padstacks specific to a package must be placed in the package's padstack directory.
cs: Musí být ve správné složce nejvyšší úrovně, tj. pro každou schematickou značkumusí být někde ve složce /symbols atd. Pájecí obrazec specifický pro a pouzdro musí být umístěno do složky /padstack.

source: The file has to end in ``.json``
cs: Název souboru musí mít příponu ``.json``

source: To get an idea of how all this looks in practice, take a look at `the pool <https://github.com/horizon-eda/horizon-pool/>`__
cs: Pro získání představy jak to všechno prakticky vypadá se podívejte do veřejného fondu na adrese <https://github.com/carrotIndustries/horizon-pool/>`__

source: The Pool database
cs: Databáze fondu

source: The Pool keeps the metadata (filenames, UUIDs, names, etc.) in a SQLite database to facilitate searching. Normally, the pool manager rebuilds the database from scratch every time something has changed. However, if you externally manipulate/remove files, you'll have to click "Update Pool" for the database to include the changes you made.
cs: Fond uchovává údaje (názvy souborů, UUID, jména atd.) V SQLite databázi usnadňující vyhledávání. Normálně si správce fondu aktualizuje databázi pokaždé, když se něco změní. Nicméně, pokud externě manipulujete / odstraňujete soubory, musíte kliknout na „Aktualizovat“ (Update Pool) databázi, která zahrne provedené změny.
