Repository: horizon-eda/horizon-docs
Catalog: locale/*/LC_MESSAGES/theory-of-operation.po
Languages: cs

source: Theory of Operation
cs: Popis funkce

source: Interactive manipulator
cs: Interaktivní manipulátor

source: Horizon's primary interface is the so-called "Interactive manipulator" (imp). It's the unified editor for symbols, schematics, padstacks, packages and boards.
cs: Primárním rozhraním Horizontu je tzv. „Interaktivní manipulátor“. Je to jednotný editor symbolů, schémat, pájecích míst (padstacks), pouzder součástek (packages) a desky plošných spojů (PCB).

source: Canvas
cs: Pracovní plocha (Canvas)

source: The canvas renders objects such as symbols, packages or tracks. The output of the rendering are line segments and triangles that get uploaded to the GPU for drawing. For rendering to to non-OpenGL targets, the canvas provides hooks to get more information on what's being rendered. So far, this is used by the gerber exporter, 3D preview and DRC.
cs: Na pracovní ploše se vykreslují objekty, jako jsou symboly schematu, pouzdra součástek nebo jednotlivé spoje. výstupem vykreslení jsou segmenty čar a trojúhelníky, které jsou následně vykresleny pomocí grafického procesoru (GPU). Chcete-li vykreslit na pracovní ploše jiné než grafické (OpenGL) objekty, pracovní plocha poskytuje nástroje pro získání více informací o tom, co je vykresleno. Zatím program umožňuje výstup ve formátu Gerber, 3D náhled na desku a kontrolu dle pravidel návrhu (DRC - Design rule checking)

source: Core
cs: Jádro (Core)

source: Since some documents such as symbols and schematics contain the same type of object (e.g. texts) and schematic and netlist need to be modified in-sync, some encapsulation has to take place. The core can be considered the glue between the document, the canvas and the tools.
cs: Protože některé dokumenty, jako jsou symboly a schémata, obsahují ty samé typy objektu (např. texty), schémata a seznam spojů (netlist) musí být modifikované synchronizovaně, musí dojít k zapouzdření. Jádro je spojovací článek mezi dokumentem, pracovní plochou a nástroji.

source: Tools
cs: Nástroje (Tools)

source: For each action the user can do, there's a tool. Once started, a tool receives keyboard and mouse input and modifies the document accordingly by means of the core. When needed, a tool may bring up additional dialogs for requesting information from the user.
cs: Pro každou akci, kterou může uživatel udělat, existuje nástroj. Vyvoláný nástroj začne přijímat vstupy z klávesnice a myši a podle funkce upravuje dokument pomocí jádra. V případě potřeby může nástroj vyvolat další dialogy pro vyžádání dodatečných informací od uživatele.

source: Property editor
cs: Editor vlastností (Property editor)

source: Low-complexity adjustments such as line width don't warrant their own tool, that's why the the core provides a property interface. The property editor's widgets are automatically generated from the object's description.
cs: Jednoduché úpravy parametrů objektů, jako je šířka čáry, neumožňují přímo jejich nástroje, proto jádro poskytuje rozhraní úprav vlastností. ovládací prvky editoru vlastností jsou automaticky generovány z popisu objektů.
